tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core", "https://github.com/Homebrew/linuxbrew-core.git"
tap "romkatv/powerlevel10k"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# CLI utility to build and manage a PKI CA
brew "easy-rsa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Process YAML documents from the CLI
brew "yq"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
